[
    [
        {
          "title": "Black Friday deals 2023: Get record-low prices on tech from Apple, Samsung, Google and others",
          "tags": "lifestyles",
          "publisher": "BBC",
          "shortdescription": "Black Friday 2023 is finally here, and if you're just getting around to your holiday shopping, there are a ton of great deals to be had across the internet. Black Friday may still technically be one day, but we've been seeing solid early Black Friday deals th…",
          "description": "Black Friday 2023 is finally here, and if you're just getting around to your holiday shopping, there are a ton of great deals to be had across the internet. Black Friday may still technically be one day, but we've been seeing solid early Black Friday deals throughout the entirety of November. Thankfully, many of them are still around today and they've joined a new crop of deals that have popped up for the post-Thanksgiving shopping event. We at Engadget care most about consumer electronics, and Black Friday (along with Cyber Monday) typically brings the best prices on the best tech that you'll be able to find all year. This year is no exception. Here are the best Black Friday deals you can get this year on laptops, tablets, headphones, smartwatches, robot vacuums and much more.",
          "type": "Premium",
          "img": "https://s.yimg.com/ny/api/res/1.2/nPBjzcYCNNTY88thOdO5_Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://s.yimg.com/os/creatr-uploaded-images/2023-11/11241060-8553-11ee-94be-4128370bbe76",
          "author": "Ken Williamson"
          
        },
        {
          "title": "Wall Street: on an indecisive note, between energy and techs",
          "tags": "technology",
          "publisher": "MarketScreener",
          "shortdescription": "The New York Stock Exchange is trading in mixed order on Friday, with renewed appetite for energy stocks offset by the reflux of tech giants following their recent rally.In late morning trading, the Dow Jones is up 0.3%, but the Nasdaq Co…",
          "description": "The New York Stock Exchange is trading in mixed order on Friday, with renewed appetite for energy stocks offset by the reflux of tech giants following their recent rally. In late morning trading, the Dow Jones is up 0.3%, but the Nasdaq Composite is down 0.2% at 14,231.4 points. Technology stocks are suffering some profit-taking after their strong gains in recent months, especially the 'Magnificent Seven' (Apple, Microsoft, Alphabet, Amazon, Meta, Tesla, and Nvidia), which have largely driven the markets this year. The P/E (12-month forward price/earnings) ratios of the Magnificent Seven are now 1.7 times higher than the S&P 500 median, which is well above the historical trend point out the teams at La Financière de l'Echiquier. Alphabet (-1.5%), Nvidia (-1.4%), Apple (-1%), and Meta (-0.8%) were the biggest decliners in the S&P 500 index at the start of the session. Closed yesterday for the Thanksgiving holiday, Wall Street will close three hours early today, at 1:00 p.m. (New York time). The energy sector was the top performer (+1%), helped by a slight upturn in oil prices less than a week ahead of the OPEC+ meeting. Chevron and ExxonMobil benefited, gaining around 1%. The basic resources (+0.6%), healthcare (+0.5%), and final (+0.5%) sectors also contributed to gains in the market's traditional sphere. Black Friday, the promotional day that kicks off the end-of-year shopping season, was only moderately successful for the retail sector.",
          "type": "Premium",
          "img":  "https://www.marketscreener.com/images/reuters/2016-12-16T212157Z_1_LYNXMPECBF1J4_RTROPTP_2_USA-STOCKS.JPG",
          "author": "Mathew Mills"
        },
        
        {
          "title": "What's open Thanksgiving 2023? Starbucks, Kroger open; Walmart closed - USA TODAY",
          "tags": "foreign",
          "publisher": "USAToday",
          "shortdescription": "Whether you're looking to pick up some last-minute groceries, grab a quick bite to eat or go shopping, consumers will have options this Thanksgiving.",
          "description": "While some national retailers and grocery stores, like Costco and Target, will be closed on Thursday, others like Kroger and Big Lots will be open, albeit some with reduced hours.More retailers have moved away from opening their stores on the holiday, a nod to a change in consumer habits and as a way for employers to demonstrate care to their workers, experts told USA TODAY.Here's everything you need to know about what's open and closed on Thursday, Nov. 23. It's best to check with your local store or restaurant online before leaving home, as hours and closures can vary by location.",
          "img": "https://image.cnbcfm.com/api/v1/image/107323759-16983355252023-10-26t153415z_1703995809_rc2d04av7oka_rtrmadp_0_usa-stocks.jpeg?v=1698357792&w=1920&h=1080",
          "author": "Fred Imbert"
        },
        {
            "title": "The three-year cruise is canceled - CNN",
            "tags": "foreign",
            "publisher": "CNN",
            "shortdescription": "Life at Sea Cruises  which was due to launch its three-year round-the-world cruise in November  has called it off. Theres no ship, and passengers are being offered refunds though the company says it still wants to launch a long-term cruise in the future.",
            "description": "They had signed up for the experience of a lifetime: three years traveling the world from the comfort of a cruise ship, at prices that rivaled regular living expenses.But now the dream is over for passengers who would signed up for Life at Sea Cruises inaugural three-year voyage. After weeks of silence, the company has acknowledged to passengers that it has no ship, and has canceled the departure, vowing to refund those who would signed up for cruises costing up to hundreds of thousands of dollars.Some of the passengers who booked the 111 cabins sold are still in Istanbul, having made their way there ahead of the original departure date. Others say they have nowhere to return to, having sold or rented out their homes in anticipation of the round-the-world voyage, as well as jettisoning their possessions.Most have spent tens of thousands of dollars on what was meant to be the experience of a lifetime, and now face a wait of at least several months to get their money back. The company has said it will make repayments in monthly installments, starting from mid-December and completing repayments in late February. It has also offered to pay for accommodation until December 1 and flights home for anyone now stranded in Istanbul. But some say they have no homes to return to.",
            "type": "Premium",
            "img": "https://media.cnn.com/api/v1/images/stellar/prod/231116081154-01-three-year-cruise-taken-off.jpg?c=16x9&q=w_800,c_fill",
            "author": "Julia Buckley"
          },
          {
            "title": "No way! The OnePlus 10 Pro cannot already be THIS cheap?!",
            "tags": "technology",
            "publisher": "AndroidCentral",
            "shortdescription": "OnePlus came back on track with the glorious OnePlus 10 Pro. This is a premium phone through and through, which is why we can't believe this Black Friday deal.",
            "description": "The OnePlus 10 Pro is a lovely, lovely thing with phenomenal specs, outstanding Hasselblad cameras, and cutting-edge performance. The device launched last year with a starting price of $899 in the U.S., which was a great deal even then. What's really amazing is that this flagship phone already costs less than half of its launch price, making this the best Android phone under $450 right now!Ideally, the best that anyone with such a tight budget would be able to afford would be the Pixel 7a or Samsung Galaxy A54. They're both great cheap phones in their own right, but they don't hold a candle to the OnePlus 10 Pro's capabilities. OnePlus went to town with last year's Pro model, outfitting it with a stunning 6.7-inch 120Hz LTPO2 AMOLED screen with HDR10 that's an absolute delight to use. This is helped along by the Snapdragon 8 Gen 1 processor and 8GB of RAM, delivering snappy performance. No task is too heavy and no game is too much for the 10 Pro to handle.Photography is a big factor when buying a phone, and the OnePlus 10 Pro lives up to expectations. The primary camera setup consists of a 48MP main lens, a 50MP wide-angle lens, and an 8MP telephoto lens, whereas the situation on the front involves a great 32MP selfie shooter. Overall, the results rival the best phones from Samsung, Google, and Apple.",
            "img": "https://cdn.mos.cms.futurecdn.net/D99TrwTeNn24jSXW45eiCm-1200-80.jpg",
            "author": "Namerah"
            
          },
          {
            "title": "What is up with… Cellnex, Fastweb & Vodafone, 1&1",
            "tags": "lifestyles",
            "publisher": "TelecomTV",
            "shortdescription": "Cellnex set to offload more business unitsFastweb eyes potential bid for Vodafone Italy assetsGermany 5G newcomer 1&1 is ready to switch on its network",
            "description": "European towers giant Cellnex Telecom is eager to continue with its asset sales and is considering a full disposal of its operations in Ireland and Austria, the company  CEO Marco Patuano told Reuters, which are reportedly valued at €1.05bn and €1.41bn respectively. These accelerated asset sales are driven by the need to reduce debt and get an investment-grade credit rating by mid-2024, as well as in preparation for a wave of consolidation in the sector. Patuano was cited as saying that the capital expenditure (capex) of the company is now absorbing all generated cash but that the tables will turn in two or three years when cash generation is expected to speed up drastically and capex commitments are expected to go into decline. In the next few years, he also expects to see consolidation among the six largest European tower operators. Cellnex is planning to introduce a new strategy in March 2024 that it will keep in place until 2026, with a view to incorporating longer-term capital allocation targets. Patuano comments come shortly after the company agreed to sell its private wireless networks unit, Edzcom, to neutral host networking specialist Boldyn Networks (formerly BAI Communications) see Boldyn Networks snaps up Cellnex private networks unit.",
            "img":  "https://assets.telecomtv.com/assets/telecomtv/cellnex-16780.jpeg?w=1200",
            "author": "TelecomTV Staff"
            
          },
          {
            "title": "Hackers leak more 23andMe data, X cracks down on porn and Andreessen writes a manifesto",
            "tags": "technology",
            "publisher": "TechCrunch",
            "shortdescription": "Welcome, folks, to Week in Review (WiR), TechCrunch regular newsletter that highlights notable tech industry happenings over the past few days. Life moves pretty fast, as a young Matthew Broderick once said — we empathize. Fortunately, there is WiR to get you caught up to speed.",
            "description": "Welcome, folks, to Week in Review (WiR), TechCrunch regular newsletter that highlights notable tech industry happenings over the past few days. Life moves pretty fast, as a young Matthew Broderick once said — we empathize. Fortunately, there is WiR to get you caught up to speed.In this edition of WiR, we cover a hacker leaking millions of 23andMe customer records, X crackdown on porn, Meta Ray-Ban sunglasses and Marc Andreessen tone-deaf manifesto. Also on the agenda is the IRS upcoming free direct tax filing service, Web Summit fight with Israel supporters, FTX execs blowing through billions of dollars and Disney Hotstar reaching new heights.",
            "img":  "https://i.ibb.co/w4c0nM3/23-and-me-leaked-data-incident-1.jpg",
            "author": "Ama Lia"
            
          },
          {
            "title": "POLL: Voters See American Dream Slipping Out of Reach",
            "tags": "business",
            "publisher": "StreetJournal",
            "shortdescription": "Welcome, folks, to Week in Review (WiR), TechCrunch regular newsletter that highlights notable tech industry happenings over the past few days. Life moves pretty fast, as a young Matthew Broderick once said — we empathize. Fortunately, there is WiR to get you caught up to speed.",
            "description": "Welcome, folks, to Week in Review (WiR), TechCrunch regular newsletter that highlights notable tech industry happenings over the past few days. Life moves pretty fast, as a young Matthew Broderick once said — we empathize. Fortunately, there is WiR to get you caught up to speed.In this edition of WiR, we cover a hacker leaking millions of 23andMe customer records, X crackdown on porn, Meta Ray-Ban sunglasses and Marc Andreessen tone-deaf manifesto. Also on the agenda is the IRS upcoming free direct tax filing service, Web Summit fight with Israel supporters, FTX execs blowing through billions of dollars and Disney Hotstar reaching new heights.",
            "type": "Premium",
            "img":   "https://images.wsj.net/im-890960/social",
            "author": "Kim Ohio"
            
          },
          {
            "title": "Your Local Newspaper Might Not Have Single Reporter",
            "tags": "business",
            "publisher": "BusinessDaily",
            "shortdescription": "Rise of ghost newsrooms spawns effort by local news startups to fill the void",
            "description": "The rise of ghost newsrooms, characterized by the decline of traditional local news outlets, has spurred a commendable effort by local news startups to fill the void. As established newsrooms face financial challenges and closures, innovative entrepreneurs are stepping in to address the growing information vacuum. These nimble startups leverage digital platforms and community engagement to deliver hyper-local news coverage, ensuring that crucial stories don't go unreported. By embracing technology and novel business models, these initiatives aim to revitalize the crucial role of journalism in informing and connecting communities. In the face of ghost newsrooms, these emerging ventures represent a promising trend, illustrating resilience and adaptability in the ever-evolving media landscape.",
            "img":   "https://images.wsj.net/im-888020/social",
            "author": "Bin Wolf"
            
          }
      ]
      
]